# Brewfile - Homebrew dependencies for dotfiles

# Taps
tap "cue-lang/tap"
tap "metalbear-co/mirrord"
tap "supabase/tap"

# Core tools
brew "direnv"
brew "displayplacer"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "jq"
brew "neovim"
brew "tmux"
brew "tree"
brew "yq"
brew "zoxide"
brew "zsh"

# Version managers
brew "mise"

# Plugin managers
brew "sheldon"

# Git TUI
brew "git-delta"
brew "jj"
brew "lazygit"

# Media tools
brew "ffmpeg"
brew "imagemagick"

# Cloud/Infrastructure
brew "azure-cli"
brew "cloudflared"
brew "cue-lang/tap/cue"
brew "kubectl"
brew "metalbear-co/mirrord/mirrord"
brew "supabase/tap/supabase"
brew "terraform"
brew "tflint"

# Database
brew "libpq"
brew "pgcli"

# Protocol/API
brew "buf"
brew "grpcurl"

# GUI Apps (Casks)
cask "antigravity"
cask "bitwarden"
cask "chatgpt"
cask "cursor"
cask "dbeaver-community"
cask "ghostty"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "todoist-app"
cask "visual-studio-code"

# Fonts
cask "font-fira-code-nerd-font"
